In [1]:
#get our database url
# create db engine via sqlalchemy

In [2]:
from env import config, BASE_DIR
from sqlalchemy import create_engine, text

In [3]:
DATABASE_URL = config("HOUSING_DATABASE_URL", cast=str, default=None)

In [4]:
DATABASE_URL is not None

True

In [5]:
engine = create_engine(DATABASE_URL)

In [6]:
DATASET_DIR = BASE_DIR / "datasets"
DATASET_DIR.exists()

True

In [7]:
HOUSES_CSV = DATASET_DIR / "housing_ds3.csv"
HOUSES_CSV.exists()

True

In [8]:
import pandas as pd

In [9]:
df = pd.read_csv(str(HOUSES_CSV))
df.head(n=10)

     saledate      MA   type  bedrooms
0  30/09/2007  441854  house         2
1  31/12/2007  441854  house         2
2  31/03/2008  441854  house         2
3  30/06/2008  441854  house         2
4  30/09/2008  451583  house         2
5  31/12/2008  440256  house         2
6  31/03/2009  442566  house         2
7  30/06/2009  446113  house         2
8  30/09/2009  440123  house         2
9  31/12/2009  442131  house         2

In [10]:
df.dtypes

saledate    object
MA           int64
type        object
bedrooms     int64
dtype: object

In [11]:
df['date'] = pd.to_datetime(df['saledate'], format="%d/%m/%Y")
df['price'] = df['MA']

In [12]:
df.dtypes

saledate            object
MA                   int64
type                object
bedrooms             int64
date        datetime64[ns]
price                int64
dtype: object

In [13]:
out_df = df.copy()[['date', 'price','type', 'bedrooms']]
out_df

          date   price   type  bedrooms
0   2007-09-30  441854  house         2
1   2007-12-31  441854  house         2
2   2008-03-31  441854  house         2
3   2008-06-30  441854  house         2
4   2008-09-30  451583  house         2
..         ...     ...    ...       ...
342 2018-09-30  603281   unit         3
343 2018-12-31  601167   unit         3
344 2019-03-31  605637   unit         3
345 2019-06-30  599339   unit         3
346 2019-09-30  597884   unit         3

[347 rows x 4 columns]

In [14]:
table_name = "kaggle_house_data"
df.to_sql(table_name, engine, if_exists='replace', index=False)

347

In [15]:
with engine.connect() as conn:
    results = conn.execute(text(f"SELECT * from {table_name} LIMIT 10"))
    print(results.all())

[('30/09/2007', 441854, 'house', 2, datetime.datetime(2007, 9, 30, 0, 0), 441854), ('31/12/2007', 441854, 'house', 2, datetime.datetime(2007, 12, 31, 0, 0), 441854), ('31/03/2008', 441854, 'house', 2, datetime.datetime(2008, 3, 31, 0, 0), 441854), ('30/06/2008', 441854, 'house', 2, datetime.datetime(2008, 6, 30, 0, 0), 441854), ('30/09/2008', 451583, 'house', 2, datetime.datetime(2008, 9, 30, 0, 0), 451583), ('31/12/2008', 440256, 'house', 2, datetime.datetime(2008, 12, 31, 0, 0), 440256), ('31/03/2009', 442566, 'house', 2, datetime.datetime(2009, 3, 31, 0, 0), 442566), ('30/06/2009', 446113, 'house', 2, datetime.datetime(2009, 6, 30, 0, 0), 446113), ('30/09/2009', 440123, 'house', 2, datetime.datetime(2009, 9, 30, 0, 0), 440123), ('31/12/2009', 442131, 'house', 2, datetime.datetime(2009, 12, 31, 0, 0), 442131)]